Documents/ВозвратТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ВозвратТМЦ</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТМЦ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.СальдоПоТаре</xr:Item>
				<xr:Item>AccumulationRegister.Сальдо</xr:Item>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>AccumulationRegister.Возвраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипВозврата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВозврата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомашина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Накладная</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНаценкой</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНаценкой</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БУ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порожняя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Возвраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Возвраты</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Сальдо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Сальдо</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВзаиморасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВзаиморасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоСписании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/СальдоПоТаре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>СальдоПоТаре</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ИсторияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЗаказов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказАгента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыВозврата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыВозврата</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыВзаиморасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыВзаиморасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безнал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Терминал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принятый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обрабатываемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгруженный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставленный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архивный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмененный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаленный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичныйВозврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолныйВозврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВозвратТМЦ/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Неопределено") ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Склад = ПараметрыСеанса.Пользователь.Склад;
		ТипВозврата = Перечисления.ТипыВозврата.Приход;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТМЦ") Тогда
		Накладная = ДанныеЗаполнения.Ссылка;
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр Остатки
	Движения.Остатки.Записывать = Истина;
	
	// регистр Возвраты
	Движения.Возвраты.Записывать = Истина;
	
	// регистр Сальдо
	Движения.Сальдо.Записывать = Истина;
	
	// регистр СальдоПоТаре
	Движения.СальдоПоТаре.Записывать = Истина;
	
	// регистр ИсторияЗаказов
	Движения.ИсторияЗаказов.Записывать = Истина;
	
	Для Каждого Строка Из Товары Цикл
		// Приход / расход суммы товара
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ?(ТипВозврата = Перечисления.ТипыВозврата.Приход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = Строка.Товар;
		Движение.Порожняя = Ложь;
		Движение.Примечание = глНайтиПримечания(Комментарий);
		Движение.Количество = Строка.Количество;
		Движение.Сумма = Строка.СуммаБазовая;
	КонецЦикла;

	Для Каждого Строка Из Тары Цикл
		// Приход / расход тары
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ?(ТипВозврата = Перечисления.ТипыВозврата.Приход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = Строка.Товар;
		Движение.Порожняя = Истина;
		Движение.Примечание = глНайтиПримечания(Комментарий);
		Движение.Количество = Строка.Количество;
		Движение.Сумма = Строка.Сумма;
		
		// Приход / расход сальдо по таре
		Движение = Движения.СальдоПоТаре.Добавить();
		Движение.ВидДвижения = ?(ТипВозврата = Перечисления.ТипыВозврата.Приход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Товар = Строка.Товар;
		Движение.Контрагент = Контрагент;
		Движение.Примечание = глНайтиПримечания(Комментарий);
		Движение.Количество = Строка.Количество;
		Движение.Сумма = Строка.Сумма;
		
		Если ТипВозврата = Перечисления.ТипыВозврата.Приход Тогда
			// Возвраты доставщиков
		 	Движение = Движения.Возвраты.Добавить();
			Движение.Период = Дата;
			Движение.Сотрудник = Водитель;
			Движение.Товар = Строка.Товар;
			Движение.Примечание = глНайтиПримечания(Комментарий);
			Движение.Количество = Строка.Количество;
		КонецЕсли;
	КонецЦикла;
	
	Если Товары.Итог("СуммаПродажная") <> 0 Тогда
		// Сальдо
		Движение = Движения.Сальдо.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ТипВзаиморасчета = Перечисления.ТипыВзаиморасчета.Безнал;
		Движение.Контрагент = Контрагент;
		Движение.Примечание = глНайтиПримечания(Комментарий);
		Движение.Сумма = Товары.Итог("СуммаПродажная");
	КонецЕсли;
	
	Если Накладная.ВидРеализации.Заказываемый И ЗначениеЗаполнено(Накладная.Заказ) Тогда
		Запись = Движения.ИсторияЗаказов.Добавить();
		Запись.Период = Дата;
		Запись.Заказ = Накладная.Заказ;
		Запись.Статус = Перечисления.СтатусыЗаказа.ЧастичныйВозврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ТипВозврата = Перечисления.ТипыВозврата.Расход Тогда
		//Дата = КонецДня(Дата);
	КонецЕсли;
КонецПроцедуры
